{"id":96,"date":"2023-05-12T13:51:47","date_gmt":"2023-05-12T13:51:47","guid":{"rendered":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/?page_id=96"},"modified":"2023-05-12T13:56:35","modified_gmt":"2023-05-12T13:56:35","slug":"96-2","status":"publish","type":"page","link":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/96-2\/","title":{"rendered":"About Us"},"content":{"rendered":"\n<p>At Exel Classes, we are passionate about education and committed to empowering students to achieve their full potential. With a team of dedicated and experienced tutors, we provide exceptional tuition services that go beyond traditional classroom learning.<\/p>\n\n\n\n<p>Our focus extends beyond academic excellence. We strive to nurture well-rounded individuals by promoting critical thinking, problem-solving skills, and a love for learning. We believe in equipping students with the tools they need to succeed in an ever-changing world.<\/p>\n\n\n\n<p>With a comprehensive curriculum and personalized attention, we cater to students of all grade levels and subjects. Whether it&#8217;s math, science, languages, or test preparation, our tutors are here to guide and support students every step of the way.<\/p>\n\n\n\n<p>We understand that every student is unique, which is why we create a supportive and inclusive learning environment. Small class sizes, interactive teaching methodologies, and modern facilities ensure that students receive the individual attention and resources necessary for their growth.<\/p>\n\n\n\n<p>Communication and collaboration with parents or guardians are essential to us. We maintain an open line of communication to keep them informed about their child&#8217;s progress and to work together in the best interest of the student.<\/p>\n\n\n\n<p>At Exel Classes, we are committed to making a positive impact on the lives of our students. Join us on this educational journey, where we strive for excellence, foster a love for learning, and empower students to reach their highest potential.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>At Exel Classes, we are passionate about education and committed to empowering students to achieve their full potential. With a team of dedicated and experienced tutors, we provide exceptional tuition services that go beyond traditional classroom learning. Our focus extends beyond academic excellence. We strive to nurture well-rounded individuals by promoting critical thinking, problem-solving skills, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":99,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/pages\/96"}],"collection":[{"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/comments?post=96"}],"version-history":[{"count":5,"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/pages\/96\/revisions"}],"predecessor-version":[{"id":102,"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/pages\/96\/revisions\/102"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/media\/99"}],"wp:attachment":[{"href":"https:\/\/exelclasses-1-bf5d40.ingress-erytho.ewp.live\/wp-json\/wp\/v2\/media?parent=96"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}